PatternAgents/Arduino_Boards/patternagents/esp8266/boards.txt
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.UploadTool=Upload Using
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.Debug=Debug port
menu.DebugLevel=Debug Level

##############################################################
TSOC-ESP8266.name=TSOC-ESP8266 by PatternAgents

TSOC-ESP8266.upload.tool=esptool
TSOC-ESP8266.upload.speed=921600
TSOC-ESP8266.upload.resetmethod=nodemcu
TSOC-ESP8266.upload.maximum_size=434160
TSOC-ESP8266.upload.maximum_data_size=81920
TSOC-ESP8266.upload.wait_for_upload_port=true
TSOC-ESP8266.serial.disableDTR=true
TSOC-ESP8266.serial.disableRTS=true

TSOC-ESP8266.build.mcu=esp8266
TSOC-ESP8266.build.f_cpu=80000000L
TSOC-ESP8266.build.board=ESP8266_ESP12
TSOC-ESP8266.build.core=esp8266
TSOC-ESP8266.build.variant=TSOC-ESP8266
TSOC-ESP8266.build.flash_mode=QIO
TSOC-ESP8266.build.spiffs_pagesize=256
TSOC-ESP8266.build.debug_port=
TSOC-ESP8266.build.debug_level=

TSOC-ESP8266.menu.UploadTool.esptool=Serial
TSOC-ESP8266.menu.UploadTool.esptool.upload.tool=esptool
TSOC-ESP8266.menu.UploadTool.esptool.upload.verbose=-vv
TSOC-ESP8266.menu.UploadTool.espota=OTA
TSOC-ESP8266.menu.UploadTool.espota.upload.tool=espota

TSOC-ESP8266.menu.CpuFrequency.80=80 MHz
TSOC-ESP8266.menu.CpuFrequency.80.build.f_cpu=80000000L
TSOC-ESP8266.menu.CpuFrequency.160=160 MHz
TSOC-ESP8266.menu.CpuFrequency.160.build.f_cpu=160000000L

TSOC-ESP8266.menu.FlashFreq.40=40MHz
TSOC-ESP8266.menu.FlashFreq.40.build.flash_freq=40
TSOC-ESP8266.menu.FlashFreq.80=80MHz
TSOC-ESP8266.menu.FlashFreq.80.build.flash_freq=80

TSOC-ESP8266.menu.FlashMode.dio=DIO
TSOC-ESP8266.menu.FlashMode.dio.build.flash_mode=dio
TSOC-ESP8266.menu.FlashMode.qio=QIO
TSOC-ESP8266.menu.FlashMode.qio.build.flash_mode=qio

TSOC-ESP8266.menu.UploadSpeed.921600=921600
TSOC-ESP8266.menu.UploadSpeed.921600.upload.speed=921600
TSOC-ESP8266.menu.UploadSpeed.512000.windows=512000
TSOC-ESP8266.menu.UploadSpeed.512000.upload.speed=512000
TSOC-ESP8266.menu.UploadSpeed.460800.linux=460800
TSOC-ESP8266.menu.UploadSpeed.460800.macosx=460800
TSOC-ESP8266.menu.UploadSpeed.460800.upload.speed=460800
TSOC-ESP8266.menu.UploadSpeed.230400.linux=230400
TSOC-ESP8266.menu.UploadSpeed.230400.macosx=230400
TSOC-ESP8266.menu.UploadSpeed.230400.upload.speed=230400
TSOC-ESP8266.menu.UploadSpeed.256000.windows=256000
TSOC-ESP8266.menu.UploadSpeed.256000.upload.speed=256000
TSOC-ESP8266.menu.UploadSpeed.115200=115200
TSOC-ESP8266.menu.UploadSpeed.115200.upload.speed=115200
TSOC-ESP8266.menu.UploadSpeed.57600=57600
TSOC-ESP8266.menu.UploadSpeed.57600.upload.speed=57600
TSOC-ESP8266.menu.UploadSpeed.9600=9600
TSOC-ESP8266.menu.UploadSpeed.9600.upload.speed=9600

TSOC-ESP8266.menu.FlashSize.512K64=512K (64K SPIFFS)
TSOC-ESP8266.menu.FlashSize.512K64.build.flash_size=512K
TSOC-ESP8266.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
TSOC-ESP8266.menu.FlashSize.512K64.build.spiffs_start=0x6B000
TSOC-ESP8266.menu.FlashSize.512K64.build.spiffs_end=0x7B000
TSOC-ESP8266.menu.FlashSize.512K64.build.spiffs_blocksize=4096
TSOC-ESP8266.menu.FlashSize.512K64.upload.maximum_size=434160

TSOC-ESP8266.menu.FlashSize.512K0=512K (no SPIFFS)
TSOC-ESP8266.menu.FlashSize.512K0.build.flash_size=512K
TSOC-ESP8266.menu.FlashSize.512K0.build.flash_ld=eagle.flash.512k0.ld
TSOC-ESP8266.menu.FlashSize.512K0.upload.maximum_size=499696

TSOC-ESP8266.menu.FlashSize.1M512=1M (512K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M512.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
TSOC-ESP8266.menu.FlashSize.1M512.build.spiffs_start=0x7B000
TSOC-ESP8266.menu.FlashSize.1M512.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.1M512.build.spiffs_blocksize=8192
TSOC-ESP8266.menu.FlashSize.1M512.upload.maximum_size=499696

TSOC-ESP8266.menu.FlashSize.1M256=1M (256K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M256.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
TSOC-ESP8266.menu.FlashSize.1M256.build.spiffs_start=0xBB000
TSOC-ESP8266.menu.FlashSize.1M256.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.1M256.build.spiffs_blocksize=4096
TSOC-ESP8266.menu.FlashSize.1M256.upload.maximum_size=761840

TSOC-ESP8266.menu.FlashSize.1M128=1M (128K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M128.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
TSOC-ESP8266.menu.FlashSize.1M128.build.spiffs_start=0xDB000
TSOC-ESP8266.menu.FlashSize.1M128.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.1M128.build.spiffs_blocksize=4096
TSOC-ESP8266.menu.FlashSize.1M128.upload.maximum_size=892912

TSOC-ESP8266.menu.FlashSize.1M64=1M (64K SPIFFS)
TSOC-ESP8266.menu.FlashSize.1M64.build.flash_size=1M
TSOC-ESP8266.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
TSOC-ESP8266.menu.FlashSize.1M64.build.spiffs_start=0xEB000
TSOC-ESP8266.menu.FlashSize.1M64.build.spiffs_end=0xFB000
TSOC-ESP8266.menu.FlashSize.1M64.build.spiffs_blocksize=4096
TSOC-ESP8266.menu.FlashSize.1M64.upload.maximum_size=958448

TSOC-ESP8266.menu.FlashSize.2M=2M (1M SPIFFS)
TSOC-ESP8266.menu.FlashSize.2M.build.flash_size=2M
TSOC-ESP8266.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
TSOC-ESP8266.menu.FlashSize.2M.build.spiffs_start=0x100000
TSOC-ESP8266.menu.FlashSize.2M.build.spiffs_end=0x1FB000
TSOC-ESP8266.menu.FlashSize.2M.build.spiffs_blocksize=8192
TSOC-ESP8266.menu.FlashSize.2M.upload.maximum_size=1044464

TSOC-ESP8266.menu.FlashSize.4M1M=4M (1M SPIFFS)
TSOC-ESP8266.menu.FlashSize.4M1M.build.flash_size=4M
TSOC-ESP8266.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
TSOC-ESP8266.menu.FlashSize.4M1M.build.spiffs_start=0x300000
TSOC-ESP8266.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
TSOC-ESP8266.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
TSOC-ESP8266.menu.FlashSize.4M1M.build.spiffs_pagesize=256
TSOC-ESP8266.menu.FlashSize.4M1M.upload.maximum_size=1044464

TSOC-ESP8266.menu.FlashSize.4M3M=4M (3M SPIFFS)
TSOC-ESP8266.menu.FlashSize.4M3M.build.flash_size=4M
TSOC-ESP8266.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
TSOC-ESP8266.menu.FlashSize.4M3M.build.spiffs_start=0x100000
TSOC-ESP8266.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
TSOC-ESP8266.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
TSOC-ESP8266.menu.FlashSize.4M3M.upload.maximum_size=1044464

TSOC-ESP8266.menu.Debug.Disabled=Disabled
TSOC-ESP8266.menu.Debug.Disabled.build.debug_port=
TSOC-ESP8266.menu.Debug.Serial=Serial
TSOC-ESP8266.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
TSOC-ESP8266.menu.Debug.Serial1=Serial1
TSOC-ESP8266.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

TSOC-ESP8266.menu.DebugLevel.None____=None
TSOC-ESP8266.menu.DebugLevel.None____.build.debug_level=
TSOC-ESP8266.menu.DebugLevel.Core____=Core
TSOC-ESP8266.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
TSOC-ESP8266.menu.DebugLevel.SSL_____=Core + SSL
TSOC-ESP8266.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
TSOC-ESP8266.menu.DebugLevel.WiFic___=Core + WiFi
TSOC-ESP8266.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
TSOC-ESP8266.menu.DebugLevel.WiFi____=WiFi
TSOC-ESP8266.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
TSOC-ESP8266.menu.DebugLevel.HTTPClient=HTTPClient
TSOC-ESP8266.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
TSOC-ESP8266.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
TSOC-ESP8266.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
TSOC-ESP8266.menu.DebugLevel.HTTPUpdate=HTTPUpdate
TSOC-ESP8266.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
TSOC-ESP8266.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
TSOC-ESP8266.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
TSOC-ESP8266.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
TSOC-ESP8266.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
TSOC-ESP8266.menu.DebugLevel.HTTPServer=HTTPServer
TSOC-ESP8266.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
TSOC-ESP8266.menu.DebugLevel.UPDATER=Updater
TSOC-ESP8266.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
TSOC-ESP8266.menu.DebugLevel.OTA_____=OTA
TSOC-ESP8266.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
TSOC-ESP8266.menu.DebugLevel.OTA2____=OTA + Updater
TSOC-ESP8266.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
TSOC-ESP8266.menu.DebugLevel.all_____=All
TSOC-ESP8266.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA

# disabled because espressif's bootloader refuses to write above 4M
# TSOC-ESP8266.menu.FlashSize.8M=8M (7M SPIFFS)
# TSOC-ESP8266.menu.FlashSize.8M.build.flash_size=1M
# TSOC-ESP8266.menu.FlashSize.8M.build.flash_ld=eagle.flash.8m.ld
# TSOC-ESP8266.menu.FlashSize.8M.build.spiffs_start=0x100000
# TSOC-ESP8266.menu.FlashSize.8M.build.spiffs_end=0x800000
# TSOC-ESP8266.menu.FlashSize.8M.build.spiffs_blocksize=8192
# TSOC-ESP8266.menu.FlashSize.16M=16M (15M SPIFFS)
# TSOC-ESP8266.menu.FlashSize.16M.build.flash_size=1M
# TSOC-ESP8266.menu.FlashSize.16M.build.flash_ld=eagle.flash.16m.ld
# TSOC-ESP8266.menu.FlashSize.16M.build.spiffs_start=0x100000
# TSOC-ESP8266.menu.FlashSize.16M.build.spiffs_end=0x1000000
# TSOC-ESP8266.menu.FlashSize.16M.build.spiffs_blocksize=8192

##############################################################
